; domain
(define 
    (domain room-domain)
    (:requirements :strips :typing)
    (:types room inhabitant time)
    (:predicates 
        (movesTo ?i - inhabitant ?r - room)
        (timeslotAvailable ?t - time)
        (available ?r - room)
        (arrivalTime ?i - inhabitant ?t - time)
        (locked ?r - room)
        (workerAtRoom ?r - room)
    )
    
    (:action showRoom
     :parameters (?r - room ?i - inhabitant ?t - time)
     :precondition
        (and
            (available ?r)
            (movesTo ?i ?r)
            (timeslotAvailable ?t)
            (arrivalTime ?i ?t)
            (workerAtRoom ?r)
            (not (locked ?r))
        )
     :effect(
	        and 
	            (not (available ?r))
		        (not (timeslotAvailable ?t))
		        (not (workerAtRoom ?r))
		  )
    )
    
    (:action unlock
     :parameters (?r - room ?t - time)
     :precondition
        (and
            (available ?r)
            (locked ?r)
            (timeslotAvailable ?t)
        )
     :effect(
	        and 
	            (not (locked ?r))
		  )
    )
    
    (:action join
     :parameters (?r - room ?t - time)
     :precondition
        (and
            (not(workerAtRoom ?r))
            (available ?r)
            (not (locked ?r))
            (timeslotAvailable ?t)
        )
     :effect(
	        and 
	            (workerAtRoom ?r)
		  )
    ))

; problem
(define 
    (problem room-problem)
    (:domain room-domain)
    (:objects 
        room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 
        room11 room12 room13 room14 room15 room16 room17 room18 room19 room20 
        room21 room22 room23 room24 room25 room26 room27 room28 room29 room30
        - room 
        
        inhabitant1 inhabitant2 inhabitant3 inhabitant4 inhabitant5 
        inhabitant6 inhabitant7 inhabitant8 inhabitant9 inhabitant10 
        inhabitant11 inhabitant12 inhabitant13 inhabitant14 inhabitant15 
        inhabitant16 inhabitant17 inhabitant18 inhabitant19 inhabitant20 
        inhabitant21 inhabitant22 inhabitant23 inhabitant24 inhabitant25 
        inhabitant26 inhabitant27 inhabitant28 inhabitant29 inhabitant30
        - inhabitant
        
        timeslot1 timeslot2 timeslot3 timeslot4 timeslot5 
        timeslot6 timeslot7 timeslot8 timeslot9 timeslot10 
        timeslot11 timeslot12 timeslot13 timeslot14 timeslot15 
        timeslot16 timeslot17 timeslot18 timeslot19 timeslot20 
        timeslot21 timeslot22 timeslot23 timeslot24 timeslot25 
        timeslot26 timeslot27 timeslot28 timeslot29 timeslot30
        - time
    )
    (:INIT 
        ; All timeslots are initially available
        (timeslotAvailable timeslot1)(timeslotAvailable timeslot2)
        (timeslotAvailable timeslot3)(timeslotAvailable timeslot4)
        (timeslotAvailable timeslot5)(timeslotAvailable timeslot6)
        (timeslotAvailable timeslot7)(timeslotAvailable timeslot8)
        (timeslotAvailable timeslot9)(timeslotAvailable timeslot10)
        (timeslotAvailable timeslot11)(timeslotAvailable timeslot12)
        (timeslotAvailable timeslot13)(timeslotAvailable timeslot14)
        (timeslotAvailable timeslot15)(timeslotAvailable timeslot16)
        (timeslotAvailable timeslot17)(timeslotAvailable timeslot18)
        (timeslotAvailable timeslot19)(timeslotAvailable timeslot20)
        (timeslotAvailable timeslot21)(timeslotAvailable timeslot22)
        (timeslotAvailable timeslot23)(timeslotAvailable timeslot24)
        (timeslotAvailable timeslot25)(timeslotAvailable timeslot26)
        (timeslotAvailable timeslot27)(timeslotAvailable timeslot28)
        (timeslotAvailable timeslot29)(timeslotAvailable timeslot30)
        
        ; All rooms are initially available
        (available room1)(available room2)(available room3)(available room4)
        (available room5)(available room6)(available room7)(available room8)
        (available room9)(available room10)(available room11)(available room12)
        (available room13)(available room14)(available room15)(available room16)
        (available room17)(available room18)(available room19)(available room20)
        (available room21)(available room22)(available room23)(available room24)
        (available room25)(available room26)(available room27)(available room28)
        (available room29)(available room30)

        ; All rooms are initially locked
        (locked room1)(locked room2)(locked room3)(locked room4)
        (locked room5)(locked room6)(locked room7)(locked room8)
        (locked room9)(locked room10)(locked room11)(locked room12)
        (locked room13)(locked room14)(locked room15)(locked room16)
        (locked room17)(locked room18)(locked room19)(locked room20)
        (locked room21)(locked room22)(locked room23)(locked room24)
        (locked room25)(locked room26)(locked room27)(locked room28)
        (locked room29)(locked room30)


        
        ; Each inhabitant moves to his/her designated room
        (movesTo inhabitant1 room1)(movesTo inhabitant2 room2)
        (movesTo inhabitant3 room3)(movesTo inhabitant4 room4)
        (movesTo inhabitant5 room5)(movesTo inhabitant6 room6)
        (movesTo inhabitant7 room7)(movesTo inhabitant8 room8)
        (movesTo inhabitant9 room9)(movesTo inhabitant10 room10)
        (movesTo inhabitant11 room11)(movesTo inhabitant12 room12)
        (movesTo inhabitant13 room13)(movesTo inhabitant14 room14)
        (movesTo inhabitant15 room15)(movesTo inhabitant16 room16)
        (movesTo inhabitant17 room17)(movesTo inhabitant18 room18)
        (movesTo inhabitant19 room19)(movesTo inhabitant20 room20)
        (movesTo inhabitant21 room21)(movesTo inhabitant22 room22)
        (movesTo inhabitant23 room23)(movesTo inhabitant24 room24)
        (movesTo inhabitant25 room25)(movesTo inhabitant26 room26)
        (movesTo inhabitant27 room27)(movesTo inhabitant28 room28)
        (movesTo inhabitant29 room29)(movesTo inhabitant30 room30)

        ; Each inhabitant arrives at one or more arbitrary timeslot(s)
        (arrivalTime inhabitant1 timeslot1)(arrivalTime inhabitant1 timeslot2)
        (arrivalTime inhabitant2 timeslot2)
        (arrivalTime inhabitant3 timeslot3)(arrivalTime inhabitant3 timeslot4)
        (arrivalTime inhabitant4 timeslot4)
        (arrivalTime inhabitant5 timeslot5)(arrivalTime inhabitant5 timeslot6)
        (arrivalTime inhabitant6 timeslot6)
        (arrivalTime inhabitant7 timeslot7)(arrivalTime inhabitant7 timeslot8)
        (arrivalTime inhabitant8 timeslot8)
        (arrivalTime inhabitant9 timeslot9)(arrivalTime inhabitant9 timeslot10)
        (arrivalTime inhabitant10 timeslot10)
        (arrivalTime inhabitant11 timeslot11)(arrivalTime inhabitant11 timeslot12)
        (arrivalTime inhabitant12 timeslot12)
        (arrivalTime inhabitant13 timeslot13)(arrivalTime inhabitant13 timeslot14)
        (arrivalTime inhabitant14 timeslot14)
        (arrivalTime inhabitant15 timeslot15)(arrivalTime inhabitant15 timeslot16)
        (arrivalTime inhabitant16 timeslot16)
        (arrivalTime inhabitant17 timeslot17)(arrivalTime inhabitant17 timeslot18)
        (arrivalTime inhabitant18 timeslot18)
        (arrivalTime inhabitant19 timeslot19)(arrivalTime inhabitant19 timeslot20)
        (arrivalTime inhabitant20 timeslot20)
        (arrivalTime inhabitant21 timeslot21)(arrivalTime inhabitant21 timeslot22)
        (arrivalTime inhabitant22 timeslot22)
        (arrivalTime inhabitant23 timeslot23)(arrivalTime inhabitant23 timeslot24)
        (arrivalTime inhabitant24 timeslot24)
        (arrivalTime inhabitant25 timeslot25)(arrivalTime inhabitant25 timeslot26)
        (arrivalTime inhabitant26 timeslot26)
        (arrivalTime inhabitant27 timeslot27)(arrivalTime inhabitant27 timeslot28)
        (arrivalTime inhabitant28 timeslot28)
        (arrivalTime inhabitant29 timeslot29)(arrivalTime inhabitant29 timeslot30)
        (arrivalTime inhabitant30 timeslot30)
    )
    (:goal 
        (and 
        (not(available room1))(not(available room2))(not(available room3))
        (not(available room4))(not(available room5))(not(available room6))
        (not(available room7))(not(available room8))(not(available room9))
        (not(available room10))(not(available room11))(not(available room12))
        (not(available room13))(not(available room14))(not(available room15))
        (not(available room16))(not(available room17))(not(available room18))
        (not(available room19))(not(available room20))(not(available room21))
        (not(available room22))(not(available room23))(not(available room24))
        (not(available room25))(not(available room26))(not(available room27))
        (not(available room28))(not(available room29))(not(available room30))
        )
    )
)

; plan
1. (unlock room30 timeslot30)
   deleted: (locked room30)
   goals met: 0 of 30
2. (join room30 timeslot30)
   added: (workeratroom room30)
   goals met: 0 of 30
3. (showroom room30 inhabitant30 timeslot30)
   deleted: (available room30) (timeslotavailable timeslot30) (workeratroom room30)
   goals met: 1 of 30
4. (unlock room28 timeslot28)
   deleted: (locked room28)
   goals met: 1 of 30
5. (join room28 timeslot28)
   added: (workeratroom room28)
   goals met: 1 of 30
6. (showroom room28 inhabitant28 timeslot28)
   deleted: (available room28) (timeslotavailable timeslot28) (workeratroom room28)
   goals met: 2 of 30
7. (unlock room26 timeslot26)
   deleted: (locked room26)
   goals met: 2 of 30
8. (join room26 timeslot26)
   added: (workeratroom room26)
   goals met: 2 of 30
9. (showroom room26 inhabitant26 timeslot26)
   deleted: (available room26) (timeslotavailable timeslot26) (workeratroom room26)
   goals met: 3 of 30
10. (unlock room24 timeslot24)
   deleted: (locked room24)
   goals met: 3 of 30
11. (join room24 timeslot24)
   added: (workeratroom room24)
   goals met: 3 of 30
12. (showroom room24 inhabitant24 timeslot24)
   deleted: (available room24) (timeslotavailable timeslot24) (workeratroom room24)
   goals met: 4 of 30
13. (unlock room22 timeslot22)
   deleted: (locked room22)
   goals met: 4 of 30
14. (join room22 timeslot22)
   added: (workeratroom room22)
   goals met: 4 of 30
15. (showroom room22 inhabitant22 timeslot22)
   deleted: (available room22) (timeslotavailable timeslot22) (workeratroom room22)
   goals met: 5 of 30
16. (unlock room20 timeslot20)
   deleted: (locked room20)
   goals met: 5 of 30
17. (join room20 timeslot20)
   added: (workeratroom room20)
   goals met: 5 of 30
18. (showroom room20 inhabitant20 timeslot20)
   deleted: (available room20) (timeslotavailable timeslot20) (workeratroom room20)
   goals met: 6 of 30
19. (unlock room18 timeslot18)
   deleted: (locked room18)
   goals met: 6 of 30
20. (join room18 timeslot18)
   added: (workeratroom room18)
   goals met: 6 of 30
21. (showroom room18 inhabitant18 timeslot18)
   deleted: (available room18) (timeslotavailable timeslot18) (workeratroom room18)
   goals met: 7 of 30
22. (unlock room16 timeslot16)
   deleted: (locked room16)
   goals met: 7 of 30
23. (join room16 timeslot16)
   added: (workeratroom room16)
   goals met: 7 of 30
24. (showroom room16 inhabitant16 timeslot16)
   deleted: (available room16) (timeslotavailable timeslot16) (workeratroom room16)
   goals met: 8 of 30
25. (unlock room14 timeslot14)
   deleted: (locked room14)
   goals met: 8 of 30
26. (join room14 timeslot14)
   added: (workeratroom room14)
   goals met: 8 of 30
27. (showroom room14 inhabitant14 timeslot14)
   deleted: (available room14) (timeslotavailable timeslot14) (workeratroom room14)
   goals met: 9 of 30
28. (unlock room12 timeslot12)
   deleted: (locked room12)
   goals met: 9 of 30
29. (join room12 timeslot12)
   added: (workeratroom room12)
   goals met: 9 of 30
30. (showroom room12 inhabitant12 timeslot12)
   deleted: (available room12) (timeslotavailable timeslot12) (workeratroom room12)
   goals met: 10 of 30
31. (unlock room10 timeslot10)
   deleted: (locked room10)
   goals met: 10 of 30
32. (join room10 timeslot10)
   added: (workeratroom room10)
   goals met: 10 of 30
33. (showroom room10 inhabitant10 timeslot10)
   deleted: (available room10) (timeslotavailable timeslot10) (workeratroom room10)
   goals met: 11 of 30
34. (unlock room8 timeslot8)
   deleted: (locked room8)
   goals met: 11 of 30
35. (join room8 timeslot8)
   added: (workeratroom room8)
   goals met: 11 of 30
36. (showroom room8 inhabitant8 timeslot8)
   deleted: (available room8) (timeslotavailable timeslot8) (workeratroom room8)
   goals met: 12 of 30
37. (unlock room6 timeslot6)
   deleted: (locked room6)
   goals met: 12 of 30
38. (join room6 timeslot6)
   added: (workeratroom room6)
   goals met: 12 of 30
39. (showroom room6 inhabitant6 timeslot6)
   deleted: (available room6) (timeslotavailable timeslot6) (workeratroom room6)
   goals met: 13 of 30
40. (unlock room4 timeslot4)
   deleted: (locked room4)
   goals met: 13 of 30
41. (join room4 timeslot4)
   added: (workeratroom room4)
   goals met: 13 of 30
42. (showroom room4 inhabitant4 timeslot4)
   deleted: (available room4) (timeslotavailable timeslot4) (workeratroom room4)
   goals met: 14 of 30
43. (unlock room2 timeslot2)
   deleted: (locked room2)
   goals met: 14 of 30
44. (join room2 timeslot2)
   added: (workeratroom room2)
   goals met: 14 of 30
45. (showroom room2 inhabitant2 timeslot2)
   deleted: (available room2) (timeslotavailable timeslot2) (workeratroom room2)
   goals met: 15 of 30
46. (unlock room29 timeslot29)
   deleted: (locked room29)
   goals met: 15 of 30
47. (join room29 timeslot29)
   added: (workeratroom room29)
   goals met: 15 of 30
48. (showroom room29 inhabitant29 timeslot29)
   deleted: (available room29) (timeslotavailable timeslot29) (workeratroom room29)
   goals met: 16 of 30
49. (unlock room27 timeslot27)
   deleted: (locked room27)
   goals met: 16 of 30
50. (join room27 timeslot27)
   added: (workeratroom room27)
   goals met: 16 of 30
51. (showroom room27 inhabitant27 timeslot27)
   deleted: (available room27) (timeslotavailable timeslot27) (workeratroom room27)
   goals met: 17 of 30
52. (unlock room25 timeslot25)
   deleted: (locked room25)
   goals met: 17 of 30
53. (join room25 timeslot25)
   added: (workeratroom room25)
   goals met: 17 of 30
54. (showroom room25 inhabitant25 timeslot25)
   deleted: (available room25) (timeslotavailable timeslot25) (workeratroom room25)
   goals met: 18 of 30
55. (unlock room23 timeslot23)
   deleted: (locked room23)
   goals met: 18 of 30
56. (join room23 timeslot23)
   added: (workeratroom room23)
   goals met: 18 of 30
57. (showroom room23 inhabitant23 timeslot23)
   deleted: (available room23) (timeslotavailable timeslot23) (workeratroom room23)
   goals met: 19 of 30
58. (unlock room21 timeslot21)
   deleted: (locked room21)
   goals met: 19 of 30
59. (join room21 timeslot21)
   added: (workeratroom room21)
   goals met: 19 of 30
60. (showroom room21 inhabitant21 timeslot21)
   deleted: (available room21) (timeslotavailable timeslot21) (workeratroom room21)
   goals met: 20 of 30
61. (unlock room19 timeslot19)
   deleted: (locked room19)
   goals met: 20 of 30
62. (join room19 timeslot19)
   added: (workeratroom room19)
   goals met: 20 of 30
63. (showroom room19 inhabitant19 timeslot19)
   deleted: (available room19) (timeslotavailable timeslot19) (workeratroom room19)
   goals met: 21 of 30
64. (unlock room17 timeslot17)
   deleted: (locked room17)
   goals met: 21 of 30
65. (join room17 timeslot17)
   added: (workeratroom room17)
   goals met: 21 of 30
66. (showroom room17 inhabitant17 timeslot17)
   deleted: (available room17) (timeslotavailable timeslot17) (workeratroom room17)
   goals met: 22 of 30
67. (unlock room15 timeslot15)
   deleted: (locked room15)
   goals met: 22 of 30
68. (join room15 timeslot15)
   added: (workeratroom room15)
   goals met: 22 of 30
69. (showroom room15 inhabitant15 timeslot15)
   deleted: (available room15) (timeslotavailable timeslot15) (workeratroom room15)
   goals met: 23 of 30
70. (unlock room13 timeslot13)
   deleted: (locked room13)
   goals met: 23 of 30
71. (join room13 timeslot13)
   added: (workeratroom room13)
   goals met: 23 of 30
72. (showroom room13 inhabitant13 timeslot13)
   deleted: (available room13) (timeslotavailable timeslot13) (workeratroom room13)
   goals met: 24 of 30
73. (unlock room11 timeslot11)
   deleted: (locked room11)
   goals met: 24 of 30
74. (join room11 timeslot11)
   added: (workeratroom room11)
   goals met: 24 of 30
75. (showroom room11 inhabitant11 timeslot11)
   deleted: (available room11) (timeslotavailable timeslot11) (workeratroom room11)
   goals met: 25 of 30
76. (unlock room9 timeslot9)
   deleted: (locked room9)
   goals met: 25 of 30
77. (join room9 timeslot9)
   added: (workeratroom room9)
   goals met: 25 of 30
78. (showroom room9 inhabitant9 timeslot9)
   deleted: (available room9) (timeslotavailable timeslot9) (workeratroom room9)
   goals met: 26 of 30
79. (unlock room7 timeslot7)
   deleted: (locked room7)
   goals met: 26 of 30
80. (join room7 timeslot7)
   added: (workeratroom room7)
   goals met: 26 of 30
81. (showroom room7 inhabitant7 timeslot7)
   deleted: (available room7) (timeslotavailable timeslot7) (workeratroom room7)
   goals met: 27 of 30
82. (unlock room5 timeslot5)
   deleted: (locked room5)
   goals met: 27 of 30
83. (join room5 timeslot5)
   added: (workeratroom room5)
   goals met: 27 of 30
84. (showroom room5 inhabitant5 timeslot5)
   deleted: (available room5) (timeslotavailable timeslot5) (workeratroom room5)
   goals met: 28 of 30
85. (unlock room3 timeslot3)
   deleted: (locked room3)
   goals met: 28 of 30
86. (join room3 timeslot3)
   added: (workeratroom room3)
   goals met: 28 of 30
87. (showroom room3 inhabitant3 timeslot3)
   deleted: (available room3) (timeslotavailable timeslot3) (workeratroom room3)
   goals met: 29 of 30
88. (unlock room1 timeslot1)
   deleted: (locked room1)
   goals met: 29 of 30
89. (join room1 timeslot1)
   added: (workeratroom room1)
   goals met: 29 of 30
90. (showroom room1 inhabitant1 timeslot1)
   deleted: (available room1) (timeslotavailable timeslot1) (workeratroom room1)
   goals met: 30 of 30
